In [ ]:
#Week 1 Day 1: Basic Queries & Filtering

In [1]:
import sqlite3
import pandas as pd

# เชื่อมต่อ Database
conn = sqlite3.connect('retail_store.db')

# ฟังก์ชันช่วยรัน SQL (จะได้ไม่ต้องพิมพ์ยาวๆ)
def run_query(sql):
    return pd.read_sql(sql, conn)

In [2]:
sql = "SELECT * FROM customers"
run_query(sql)

   customer_id     name  age        city  total_spend membership_level
0            1  Somchai   25     Bangkok         1500           Bronze
1            2   Somsri   32  Chiang Mai         4500           Silver
2            3     John   45     Bangkok        12000             Gold
3            4    Alice   28      Phuket          800           Bronze
4            5    David   35     Bangkok        25000         Platinum
5            6      Eve   22   Khon Kaen          300           Bronze
6            7      Bob   40     Bangkok         6000           Silver
7            8    Grace   30    Chonburi         9500             Gold
8            9    Harry   50     Bangkok           50           Bronze
9           10     Jane   27  Chiang Mai         3200           Silver

In [3]:
# เขียน SQL ตรงนี้
sql = "SELECT * FROM customers WHERE city = 'Chiang Mai'"

run_query(sql)

   customer_id    name  age        city  total_spend membership_level
0            2  Somsri   32  Chiang Mai         4500           Silver
1           10    Jane   27  Chiang Mai         3200           Silver

In [4]:
# ใบ้: SELECT ... FROM ... WHERE ... ORDER BY ... LIMIT ...
sql = "SELECT * FROM customers WHERE City != 'Bangkok' ORDER BY total_spend DESC LIMIT 3"

run_query(sql)

   customer_id    name  age        city  total_spend membership_level
0            8   Grace   30    Chonburi         9500             Gold
1            2  Somsri   32  Chiang Mai         4500           Silver
2           10    Jane   27  Chiang Mai         3200           Silver

In [ ]:
#Week 1 Day 2: Aggregation & Grouping (การสรุปผลข้อมูล)

In [5]:
# โจทย์: นับจำนวนลูกค้าทั้งหมด และ หาผลรวมยอดขาย
sql = "SELECT COUNT(*) AS total_customers, SUM(total_spend) AS total_revenue FROM customers"

run_query(sql)

   total_customers  total_revenue
0               10          62850

In [6]:
sql ="SELECT city, COUNT(*), SUM(total_spend) FROM customers GROUP BY city"

run_query(sql)

         city  COUNT(*)  SUM(total_spend)
0     Bangkok         5             44550
1  Chiang Mai         2              7700
2    Chonburi         1              9500
3   Khon Kaen         1               300
4      Phuket         1               800

In [7]:
sql ="SELECT city, SUM(total_spend) FROM customers GROUP BY city HAVING SUM(total_spend) > 5000"

run_query(sql)

         city  SUM(total_spend)
0     Bangkok             44550
1  Chiang Mai              7700
2    Chonburi              9500

In [ ]:
#Week 1 Day 3: Joining Tables (การเชื่อมโยงข้อมูล)

In [8]:
import sqlite3
import pandas as pd

# 1. สร้างฟังก์ชัน run_query ขึ้นมาใหม่
def run_query(sql):
    conn = sqlite3.connect('retail_store.db') # เชื่อมต่อฐานข้อมูล
    return pd.read_sql(sql, conn)

# 2. เขียนคำสั่ง SQL (ที่คุณเขียนไว้ถูกต้องแล้วครับ)
sql = """
SELECT customers.name, orders.product_name, orders.amount
FROM customers
INNER JOIN orders ON customers.customer_id = orders.customer_id
"""

# 3. สั่งรัน
run_query(sql)

      name product_name  amount
0  Somchai        Mouse     500
1  Somchai     Keyboard    1000
2     John      Monitor   12000
3    David       Laptop   25000
4   Somsri        Mouse     500
5    Grace      Headset    2000
6    Grace       Webcam    1500

In [9]:
sql = """
SELECT customers.name, orders.product_name
FROM customers
LEFT JOIN orders ON customers.customer_id = orders.customer_id
"""
run_query(sql)

       name product_name
0   Somchai     Keyboard
1   Somchai        Mouse
2    Somsri        Mouse
3      John      Monitor
4     Alice         None
5     David       Laptop
6       Eve         None
7       Bob         None
8     Grace      Headset
9     Grace       Webcam
10    Harry         None
11     Jane         None

In [10]:
sql = """
SELECT customers.name, SUM(orders.amount) AS total_spent
FROM customers
INNER JOIN orders ON customers.customer_id = orders.customer_id
GROUP BY customers.name
ORDER BY total_spent DESC
"""

run_query(sql)

      name  total_spent
0    David        25000
1     John        12000
2    Grace         3500
3  Somchai         1500
4   Somsri          500

In [ ]:
#Week 1 Day 4: Conditional Logic & Date (Logic ขั้นสูง)

In [2]:
import sqlite3
import pandas as pd

# 1. สร้างฟังก์ชัน run_query ขึ้นมาใหม่ (กันเหนียว)
def run_query(sql):
    conn = sqlite3.connect('retail_store.db') # เชื่อมต่อฐานข้อมูล
    return pd.read_sql(sql, conn)

# 2. เขียน SQL แบ่งเกรดลูกค้า (CASE WHEN)
sql = """
SELECT name, total_spend,
    CASE
        WHEN total_spend > 10000 THEN 'VIP'
        WHEN total_spend > 5000 THEN 'Gold'
        ELSE 'General'
    END AS customer_segment
FROM customers
"""

# 3. สั่งรัน
run_query(sql)

      name  total_spend customer_segment
0  Somchai         1500          General
1   Somsri         4500          General
2     John        12000              VIP
3    Alice          800          General
4    David        25000              VIP
5      Eve          300          General
6      Bob         6000             Gold
7    Grace         9500             Gold
8    Harry           50          General
9     Jane         3200          General

In [3]:
sql = """
SELECT
    customers.name,
    SUM(orders.amount) AS total_spent,
    CASE
        WHEN SUM(orders.amount) > 20000 THEN 'Platinum'
        WHEN SUM(orders.amount) > 5000 THEN 'Gold'
        ELSE 'Silver'
    END AS status
FROM customers
INNER JOIN orders ON customers.customer_id = orders.customer_id
GROUP BY customers.name
ORDER BY total_spent DESC
"""

# 3. รันผลลัพธ์
run_query(sql)

      name  total_spent    status
0    David        25000  Platinum
1     John        12000      Gold
2    Grace         3500    Silver
3  Somchai         1500    Silver
4   Somsri          500    Silver